[[["be372488-2b41-48e8-93f8-cb2691328d8e",{"pageContent":"\n\n \n \n \n \nDEPARTAMENTO DE CIENCIAS DE LA COMPUTACIÓN Y \nELECTRÓNICA \n \n  \nNombre de la asignatura: Modelado de Sistemas \nTitulación: Tecnologías de la Información \nCiclo: Cuarto \nCaso de estudio  \n  \n  \n  \n  \n  \nProfesor (es):  \nRoddy Andrés Correa Tenesaca. \nDaniel Alejandro Guamán Coronel  \n  \n  \nAbril 2023 – Agosto 2023 \n  \n\nCaso de estudio: “Desarrollo de un sistema de alerta de incidencias ciudadanas” \nContexto: \nEn  la  actualidad,  las  organizaciones  e  instituciones  gubernamentales  a  nivel  de  Ecuador,  tienen  la \nnecesidad de optimizar recursos (humanos, materiales, financieros e intangibles), tomando en cuenta \nel  punto  de  vista  económico,  la  forma  en  cómo  se  usa  eficientemente  el  tiempo  y  los  recursos \nhumanos que permitan atender las incidencias ciudadanas como instrumento de participación en todo \nsu contexto. \nAcciones  ciudadanas  como  reportar  una  tubería  de  agua  potable  averiada,  reportar  vias  en  mal \nestado,  reportar  un  incendio,  o  un  incidente  ciudadano  de  cualquier  índole,  permitiría  un  trabajo \nintegral y mancomunado entre las instituciones gubernamentales, tales como: Municipios, Bomberos, \nPolicia Nacional, Seguro Social, entre otros.  \nEn este sentido, a través del presente caso de estudio, se requiere que usted como estudiante de la \ncarrera de Tecnologías de la Información de la UTPL, proponga una solución documentada donde se \nponga  énfasis  en  el  uso  de  tecnología  digital,  de  fácil  acceso  y  mantenimiento  para  las  partes \ninvolucradas. Con  el  objetivo que  los  los  ciudadanos sean  participes  del  desarrollo  de  la  ciudad  y  a \ntravés del reporte de incidencias, tengan la capacidad de alertar a las instituciones gubernamentales \ndiversas  incidencias  o  necesidades  ciudadanas,  a  través  del  envio  y  notificación  de  elementos \nmultimedia tales como: fotografías, videos, audios, etc.. Algunas incidencias de ejemplo se presentan \na continuación: \n- Reportar una avería en el espacio público y que necesite ser atendida, como, por ejemplo, una \ntubería averiada que necesite ser reparada, algún tipo de hundimiento en una calle, etc. \n- Notificar un siniestro vehicular, choque, atropellamiento o algún cualquier otro evento de tipo \nvehicular. \n- Requerir atención médica en una dirección específica, por alguna ocurrencia. \n- Notificar un incendio, un robo o algún incidente de seguridad. \n- Entre otros incidentes. \nEl  reto  al  que  usted  se  enfrenta  en  este  caso  de  estudio,  es  que  su  propuesta  tecnológica  tenga  la \ncapacidad  de:  receptar  los  incidentes  de  la  ciudadania,  canalizarlos  o  direccionarlos  ,  clasificarlos  y \npermitir que estos tengan un seguimiento abierto tanto por la entidad gubernamental como por parte \nde la ciudadanía.  \nPara alcanzar aquello, el Gobierno  Autónomo Descentralizado - GAD, como entidad gubernamental, \nserá el encargado de ejecutar estas acciones a través del “Sistema de alerta Incidencias Ciudadanas”, \nlo  que  quiere  decir  que,  será  el  actor  principal  y  encargado  de  gestionar,  mantener  y  garantizar  la \ndisponibilidad de este sistema. El sistema en mención deberá proporcionar las interfaces necesarias \npara  que  cada  una  de  las  entidades  gubernamentales  y  los  actores  involucrados  (Policía  Nacional, \nBomberos,  etc.),  puedan  receptar  la  incidencia  en  tiempo  real  y  sean  estos  quienes  articulen  la \natención, posterior respuesta y finalización de la incidencia. \nEl  GAD  Municipal,  al  ser  el  actor  principal, también  contará  con  interfaces  internas  para  que  los \ndepartamentos  encargados,  como,  por  ejemplo,  el  de  Obras  Públicas,  atiendan  sus  incidencias  de \nforma  transparente,  eficiente  y  eficaz.  Para  un  entendimiento,  general  de  lo  que  se  requiere,  se \nsugiere revisar la Figura 1, diseñada usando elementos de C4 model, en el cuál consta el flujo en alto \nnivel, que deberá solucionar. \n\nFigura 1. Diagrama de necesidades \nPara realizar la propuesta de solución usted deberá considerar al menos las siguientes restricciones: \n• La App móvil, deberá estar disponible para Android e iOS y deberá comunicarse con el \nSistema de Incidencias; es decir, no almacenará internamente en el móvil ningún tipo de \ndato. Entre sus funciones principales, la App deberá soportar: \no Reporte de la incidencia a través de audio, texto y/o video. \no Notificaciones push para conocer el estado de la incidencia. \no Registro al sistema a través de redes sociales o correo electrónico. \n• El sistema de Incidencias estará disponible a través de la Web y deberá considerar: \no Acceso a través de roles y usuarios para cada uno de los actores involucrados. \no Soportar autenticación del App Móvil. \no Clasificación automática de la información receptada. \no Comunicación en tiempo real con la App Móvil. \no Seguimiento de la incidencia, asignación de responsables y uso de recursos \n(económicos, físicos, humanos, etc.) \no Almacenar los datos de diferentes tipos (estructurados, semiestructurados y no \nestructurados) \no Permitir que la información esté disponible para la ciudadanía a través de un API \nAbierta. \no Disponibilidad del servicio las 24 horas del día, los 365 días del año. \n• Los componentes del sistema de Incidencias deberán ser desplegados totalmente en la nube \nde su preferencia (AWS, GCP, Azure) \nOtras consideraciones técnicas \nAdemás de los criterios antes mencionados, la solución que usted proponga debe tener en cuenta las \nsiguientes consideraciones técnicas:   \n\n▪ Su  propuesta  de  solución  debe  estar  documentada  de  forma  textual  y/o  gráfica  donde  se \nexpongan los principales procesos de negocio, flujos y cadena de valor, tecnología y sistemas \nde software actual y futura, para ello puede hacer uso de documentación que proponen los \nestándares o normas de la industria, o puede usar documentación que utilice en su empresa \no lugar de trabajo la misma que podrá adaptarla al presente caso de estudio. \n▪ Que   se   tenga   en   cuenta   aspectos   de   confidencialidad   para   los   datos   e   información \nconsiderados  sensibles,  los  cuales  son  intercambiados  entre  un  emisor  y  uno  o  varios \nreceptores  (cliente(s),  sistema(s),  base  de  datos). Los  datos  considerados  confidenciales \ndeben estar encriptados, haciendo uso de algoritmos de encriptación y desencriptación.   \n▪ Que  las  operaciones  de  consulta  de  datos  que  se  realizan  desde  la  interfaz  gráfica  de  cada \nfuncionalidad de los sistemas no superen los 30 segundos. \n▪ Que   los   reportes   que   generan   las   funcionalidades   del   sistema   se   puedan   exportar \nen diversos formatos pdf, xls, xml, csv.   \n▪ Para las comunicaciones externas entre servidores de datos, aplicación móvil y cliente deben \ntener en cuenta el uso de protocolos de y/o certificados de seguridad. \n▪ La aplicación web debe poseer un diseño “Responsive” a fin de garantizar la adecuada \nvisualización   en   múltiples   computadores   personales,   dispositivos   tableta   y   teléfonos \ninteligentes. ","metadata":{"source":"./uploads/Caso_de_estudio_abr-ago23/Caso_de_estudio_abr-ago23-parsed.txt"}}]],{"0":"be372488-2b41-48e8-93f8-cb2691328d8e"}]